notes/live-coding/10-02-infinite-data-in-Scala.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-05 Mon 12:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Infinite data in Scala</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="We discuss the notion of “infinite data”, and show
how we can represent such data in Scala."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Infinite data in Scala</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#Call-by-value-and-call-by-name">3. Call by value and call by name</a></li>
<li><a href="#Parameter-passing-in-Scala">4. Parameter passing in Scala</a></li>
<li><a href="#What's-the-point?">5. What's the point?</a></li>
<li><a href="#Infinite-data!">6. Infinite data!</a>
<ul>
<li><a href="#Not-with-lists…">6.1. Not with lists…</a></li>
<li><a href="#…instead,-with-lazy-lists-or-streams!">6.2. …instead, with lazy lists or streams!</a></li>
</ul>
</li>
<li><a href="#Implementing-our-own-infinite-datatypes">7. <del>(Not)</del> Implementing our own infinite datatypes</a>
<ul>
<li><a href="#The-approach">7.1. The approach</a></li>
<li><a href="#~case-object~?">7.2. <code>case object</code>?</a></li>
<li><a href="#Defining-some-methods-on-our-streams">7.3. Defining some methods on our streams</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created for, and in some parts <b>during</b>,
the lecture on October 2nd and the following tutorials.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
In our current lectures, we have been discussing the λ-calculus,
and as of the time of writing this, we are about to discuss
reduction strategies.
</p>

<p>
The reduction strategies used in the λ-calculus
correspond to the parameter-passing methods
used in conventional programming languages.
</p>
</div>
</div>

<div id="outline-container-Call-by-value-and-call-by-name" class="outline-2">
<h2 id="Call-by-value-and-call-by-name"><span class="section-number-2">3</span> Call by value and call by name</h2>
<div class="outline-text-2" id="text-Call-by-value-and-call-by-name">
<p>
Today, we are interested in the
“call by value” and “call by name”
reduction strategies/parameter-passing methods.
</p>
<ul class="org-ul">
<li>Under “call by value” semantics,
a function application is only evaluated after
its arguments have been reduced to values.</li>
<li>Under “call by name” (or “call by need”) semantics,
no arguments in a function application are evaluated before
the function is applied.
<ul class="org-ul">
<li>(And no reduction is allowed inside abstractions.)</li>
</ul></li>
</ul>

<p>
(Under both schemes, the leftmost, outermost valid reduction is done first.)
</p>

<p>
We can see the difference by considering a sample redex
in the λ-calculus.
</p>
<div class="org-src-container">
<pre class="src src-text"><span style="color: #00cd68;">(</span>&#955; x &#8594; x x<span style="color: #00cd68;">)(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
<p>
Notice that there are two possible applications to carry out;
applying <code>λ z → z</code> to <code>λ y → y</code>, or
applying <code>(λ y → y) (λ z → z)</code> to <code>λ x → x x</code>.
</p>

<p>
A call-by-value semantics requires that the right side be evaluated first;
“a function application is only evaluated
after its arguments have been reduced to values”.
So we cannot perform the outermost application until the term on the right
is reduced.
</p>
<div class="org-src-container">
<pre class="src src-text">  <span style="color: #00cd68;">(</span>&#955; x &#8594; x x<span style="color: #00cd68;">)(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#10230; <span style="color: #00cd68;">(</span>&#955; x &#8594; x x<span style="color: #00cd68;">)(</span>&#955; z &#8594; z<span style="color: #00cd68;">)</span>
&#10230; <span style="color: #00cd68;">(</span>&#955; z &#8594; z<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span>&#955; z &#8594; z<span style="color: #00cd68;">)</span>
&#8594; &#955; z &#8594; z
= id
</pre>
</div>

<p>
A call-by-name semantics instead requires that the outside
application is evaluated first;
“no arguments in a function application are evaluated before
the function is applied”.
So we cannot perform the application in the term on the right
until we apply the outermost application.
</p>
<div class="org-src-container">
<pre class="src src-text">  <span style="color: #00cd68;">(</span>&#955; x &#8594; x x<span style="color: #00cd68;">)(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#10230; <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#8594; <span style="color: #00cd68;">(</span>&#955; z &#8594; z<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>&#955; y &#8594; y<span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>&#955; z &#8594; z<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
&#8594; <span style="color: #00cd68;">(</span>&#955; y &#8594; y<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span>&#955; z &#8594; z<span style="color: #00cd68;">)</span>
&#8594; &#955; z &#8594; z
= id
</pre>
</div>
</div>
</div>

<div id="outline-container-Parameter-passing-in-Scala" class="outline-2">
<h2 id="Parameter-passing-in-Scala"><span class="section-number-2">4</span> Parameter passing in Scala</h2>
<div class="outline-text-2" id="text-Parameter-passing-in-Scala">
<p>
By default, Scala uses a call-by-value strategy.
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f</span><span style="color: #00cd68;">(</span>x<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Int</span><span style="color: #00cd68;">)</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Unit</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00cd68;">{</span> println<span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"Called f with argument"</span><span style="color: #b6a0ff;">)</span>; println<span style="color: #b6a0ff;">(</span>x<span style="color: #b6a0ff;">)</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
You may <i>opt-in</i> to call by name using what they call “by name parameters”;
simply prepend <code>=&gt;</code> to the type.
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">g</span><span style="color: #00cd68;">(</span>y<span style="color: #b6a0ff;">:</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Int</span><span style="color: #00cd68;">)</span> <span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Unit</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00cd68;">{</span> println<span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"Called g with argument"</span><span style="color: #b6a0ff;">)</span>; println<span style="color: #b6a0ff;">(</span>y<span style="color: #b6a0ff;">)</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
Let us create a value that is not immediately evaluated,
and which communicates when it is evaluated,
so we can use it as an argument to test out our above definitions.
One way to do this is by defining it as a method with no parameters.
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">x</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Int</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00cd68;">{</span> println<span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"Evaluated x"</span><span style="color: #b6a0ff;">)</span>; <span style="color: #00bcff;">1</span> <span style="color: #00cd68;">}</span>
</pre>
</div>
<p>
:TODO: explain the term lazy
</p>

<p>
Scala also has “lazy” values, which are not evaluated until used.
:TODO: how is this different than x?
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #f78fe7;">lazy</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">y</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Int</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00cd68;">{</span> println<span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"Evaluated y"</span><span style="color: #b6a0ff;">)</span>; <span style="color: #00bcff;">2</span> <span style="color: #00cd68;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-What's-the-point?" class="outline-2">
<h2 id="What's-the-point?"><span class="section-number-2">5</span> What's the point?</h2>
<div class="outline-text-2" id="text-What's-the-point?">
<p>
Why do we want to be allowed to use call by name semantics
and lazy values?
</p>

<p>
It may make some tasks easier conceptually;
for instance, one common use case involves a function
on the natural numbers, such as one that returns the “nth” prime.
</p>

<p>
We could certainly write such a function,
but an alternative approach is to <i>lazily</i> construct
the list of all primes by <i>filtering</i> the list of all naturals.
Since it is lazily constructed, no space is used
until we begin to look up elements in the list.
(Code courtesy of this <a href="https://stackoverflow.com/q/15594227/2041536">StackOverflow</a> post,
modified to work with <code>LazyList</code>.)
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #f78fe7;">lazy</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">ps</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">LazyList</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Int</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span>
  <span style="color: #00bcff;">2</span> #:: <span style="color: #00bcff;">LazyList</span>.from<span style="color: #00cd68;">(</span><span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>.filter<span style="color: #00cd68;">(</span>i <span style="color: #b6a0ff;">=&gt;</span> ps.takeWhile<span style="color: #b6a0ff;">{</span>j <span style="color: #b6a0ff;">=&gt;</span> j * j &lt;= i<span style="color: #b6a0ff;">}</span>.forall<span style="color: #b6a0ff;">{</span> k <span style="color: #b6a0ff;">=&gt;</span> i % k &gt; <span style="color: #00bcff;">0</span><span style="color: #b6a0ff;">}</span><span style="color: #00cd68;">)</span>;
</pre>
</div>

<p>
And, because lazy data is not re-evaluated,
once we have looked up elements, the already calculated portion
of the list is automatically cached for us!
This is (in some instances) an advantage over the function.
</p>

<p>
Now, we have subtlely used another concept enabled by lazy values
and call-by-name semantics in the above: an infinite list!
</p>
</div>
</div>

<div id="outline-container-Infinite-data!" class="outline-2">
<h2 id="Infinite-data!"><span class="section-number-2">6</span> Infinite data!</h2>
<div class="outline-text-2" id="text-Infinite-data!">
</div>

<div id="outline-container-Not-with-lists…" class="outline-3">
<h3 id="Not-with-lists…"><span class="section-number-3">6.1</span> Not with lists…</h3>
<div class="outline-text-3" id="text-Not-with-lists…">
<p>
When we discuss lists in computer science,
they are usually defined as having <i>finite</i> length.
</p>

<p>
Let us try to break away from that convention.
We can define an infinite list by using recursion.
But what does you intuition tell you will happen here?
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #f78fe7;">lazy</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">ones</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">List</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Int</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">1</span> :: ones
</pre>
</div>
</div>
</div>

<div id="outline-container-…instead,-with-lazy-lists-or-streams!" class="outline-3">
<h3 id="…instead,-with-lazy-lists-or-streams!"><span class="section-number-3">6.2</span> …instead, with lazy lists or streams!</h3>
<div class="outline-text-3" id="text-…instead,-with-lazy-lists-or-streams!">
<p>
The <a href="https://www.scala-lang.org/api/current/scala/collection/immutable/LazyList.html">lazy list</a> type and
the <a href="https://www.scala-lang.org/api/current/scala/collection/immutable/Stream.html">stream</a> type (now deprecated in favour of lazy lists)
actually allow us to define such lists.
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #f78fe7;">lazy</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">ones</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">LazyList</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Int</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">1</span> #:: ones
</pre>
</div>

<p>
We can then make these lists more interesting
by filtering, zipping, etc.;
or by writing more interesting recursive definitions.
</p>
</div>
</div>
</div>

<div id="outline-container-Implementing-our-own-infinite-datatypes" class="outline-2">
<h2 id="Implementing-our-own-infinite-datatypes"><span class="section-number-2">7</span> <del>(Not)</del> Implementing our own infinite datatypes</h2>
<div class="outline-text-2" id="text-Implementing-our-own-infinite-datatypes">
</div>

<div id="outline-container-The-approach" class="outline-3">
<h3 id="The-approach"><span class="section-number-3">7.1</span> The approach</h3>
<div class="outline-text-3" id="text-The-approach">
<p>
To implement such a type <code>T</code> with the algebraic datatype approach
we have been using, we may use (recursive) parameters
of the form <code>Unit =&gt; T</code>.
</p>

<p>
Function parameters are <i>never</i> evaluated until
the function is invoked (called.)
<b>This will approach will work in any language with
higher-order functions.</b>
</p>

<p>
For example, we can define our own variant of streams.
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #f78fe7;">sealed</span> <span style="color: #b6a0ff;">trait</span> <span style="color: #f78fe7;">Stream</span><span style="color: #00cd68;">[</span>+<span style="color: #00bcff;">A</span><span style="color: #00cd68;">]</span> <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Stream is covariant (marked by the +)</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">object</span> <span style="color: #00bcff;">SNil</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #f78fe7;">Stream</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Nothing</span><span style="color: #00cd68;">]</span> <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">The singleton Nil object</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">Cons</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">](</span>a<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">A</span>, f<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Unit</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Stream</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">A</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #f78fe7;">Stream</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-~case-object~?" class="outline-3">
<h3 id="~case-object~?"><span class="section-number-3">7.2</span> <code>case object</code>?</h3>
<div class="outline-text-3" id="text-~case-object~?">
<p>
We adopt here and now the convention of making our base case
a <code>case object</code>, rather than a <code>case class</code>.
The difference is that there is exactly one instance of
a <code>case object</code> (it is a singleton),
whereas there can be many of a <code>case class</code>.
Since there can only be one instance of <code>Nil</code>,
this instance needs to be a member of <code>Stream[A]</code> for any <code>A</code>,
so it must be a member of <code>Stream[Nothing]</code>, since <code>Nothing</code> is
the only subtype of all types.
This does require us to mark <code>Stream</code> as <i>covariant</i>,
meaning that <code>Stream[A]</code> is a subtype of <code>Stream[B]</code> is <code>A</code> is a subtype of <code>B</code>.
(We will discuss subtyping, variance and covariance
in more detail later in the course.)
</p>
</div>
</div>

<div id="outline-container-Defining-some-methods-on-our-streams" class="outline-3">
<h3 id="Defining-some-methods-on-our-streams"><span class="section-number-3">7.3</span> Defining some methods on our streams</h3>
<div class="outline-text-3" id="text-Defining-some-methods-on-our-streams">
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">constantStream</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">](</span>a<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">A</span><span style="color: #00cd68;">)</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Stream</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Cons</span><span style="color: #00cd68;">(</span>a, <span style="color: #b6a0ff;">_</span> <span style="color: #b6a0ff;">=&gt;</span> constantStream<span style="color: #b6a0ff;">(</span>a<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">take</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">](</span>n<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Int</span>, s<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Stream</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">A</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">List</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">A</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span> s <span style="color: #b6a0ff;">match</span> <span style="color: #00cd68;">{</span>
  <span style="color: #b6a0ff;">case</span> <span style="color: #00bcff;">SNil</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Nil</span>
  <span style="color: #b6a0ff;">case</span> <span style="color: #f78fe7;">Cons</span><span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">a</span>,<span style="color: #00d3d0;">f</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> n <span style="color: #b6a0ff;">match</span> <span style="color: #b6a0ff;">{</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #00d3d0;">n</span> <span style="color: #b6a0ff;">if</span> n &gt; <span style="color: #00bcff;">0</span> <span style="color: #b6a0ff;">=&gt;</span> a :: take<span style="color: #6ae4b9;">(</span>n-1,f<span style="color: #f0ce43;">()</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">_</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Nil</span>
    <span style="color: #b6a0ff;">}</span>
  <span style="color: #00cd68;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-10-05 Mon 10:22</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
